src/test/resources/__files/correios/exemplo_request.xml

<?xml version="1.0" ?><S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope"><S:Body><CalcPrecoPrazo xmlns="http://tempuri.org/"><nCdEmpresa>empresa</nCdEmpresa><sDsSenha></sDsSenha><nCdServico></nCdServico><sCepOrigem>13220901</sCepOrigem><sCepDestino>13220901</sCepDestino><nVlPeso>10</nVlPeso><nCdFormato>0</nCdFormato><nVlComprimento>20</nVlComprimento><nVlAltura>15</nVlAltura><nVlLargura>5</nVlLargura><nVlDiametro>0</nVlDiametro><sCdMaoPropria></sCdMaoPropria><nVlValorDeclarado>0</nVlValorDeclarado><sCdAvisoRecebimento></sCdAvisoRecebimento></CalcPrecoPrazo></S:Body></S:Envelope>